## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
16:55:46.228 STDOUT terraform:   + create
16:55:46.228 STDOUT terraform:   ~ update in-place
16:55:46.228 STDOUT terraform: Terraform planned the following actions, but then encountered a problem:
16:55:46.228 STDOUT terraform:   # aws_iam_policy.newrelic_aws_permissions[0] will be created
16:55:46.228 STDOUT terraform:   + resource "aws_iam_policy" "newrelic_aws_permissions" {
16:55:46.228 STDOUT terraform:       + arn              = (known after apply)
16:55:46.228 STDOUT terraform:       + attachment_count = (known after apply)
16:55:46.228 STDOUT terraform:       + id               = (known after apply)
16:55:46.228 STDOUT terraform:       + name             = "NewRelicCloudStreamReadPermissions-staging"
16:55:46.228 STDOUT terraform:       + name_prefix      = (known after apply)
16:55:46.228 STDOUT terraform:       + path             = "/"
16:55:46.228 STDOUT terraform:       + policy           = jsonencode(
16:55:46.228 STDOUT terraform:             {
16:55:46.228 STDOUT terraform:               + Statement = [
16:55:46.228 STDOUT terraform:                   + {
16:55:46.228 STDOUT terraform:                       + Action   = [
16:55:46.228 STDOUT terraform:                           + "budgets:ViewBudget",
16:55:46.229 STDOUT terraform:                           + "cloudtrail:LookupEvents",
16:55:46.229 STDOUT terraform:                           + "config:BatchGetResourceConfig",
16:55:46.229 STDOUT terraform:                           + "config:ListDiscoveredResources",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeVpcs",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeNatGateways",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeVpcEndpoints",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeSubnets",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeNetworkAcls",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeVpcAttribute",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeRouteTables",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
16:55:46.229 STDOUT terraform:                           + "ec2:DescribeVpnConnections",
16:55:46.229 STDOUT terraform:                           + "health:DescribeAffectedEntities",
16:55:46.229 STDOUT terraform:                           + "health:DescribeEventDetails",
16:55:46.229 STDOUT terraform:                           + "health:DescribeEvents",
16:55:46.229 STDOUT terraform:                           + "tag:GetResources",
16:55:46.229 STDOUT terraform:                           + "xray:BatchGet*",
16:55:46.229 STDOUT terraform:                           + "xray:Get*",
16:55:46.229 STDOUT terraform:                         ]
16:55:46.229 STDOUT terraform:                       + Effect   = "Allow"
16:55:46.229 STDOUT terraform:                       + Resource = "*"
16:55:46.229 STDOUT terraform:                     },
16:55:46.229 STDOUT terraform:                 ]
16:55:46.229 STDOUT terraform:               + Version   = "2012-10-17"
16:55:46.230 STDOUT terraform:             }
16:55:46.230 STDOUT terraform:         )
16:55:46.230 STDOUT terraform:       + policy_id        = (known after apply)
16:55:46.230 STDOUT terraform:       + tags_all         = (known after apply)
16:55:46.230 STDOUT terraform:         # (1 unchanged attribute hidden)
16:55:46.230 STDOUT terraform:     }
16:55:46.230 STDOUT terraform:   # aws_iam_role.firehose_newrelic_role[0] will be created
16:55:46.230 STDOUT terraform:   + resource "aws_iam_role" "firehose_newrelic_role" {
16:55:46.230 STDOUT terraform:       + arn                   = (known after apply)
16:55:46.230 STDOUT terraform:       + assume_role_policy    = jsonencode(
16:55:46.230 STDOUT terraform:             {
16:55:46.230 STDOUT terraform:               + Statement = [
16:55:46.230 STDOUT terraform:                   + {
16:55:46.230 STDOUT terraform:                       + Action    = "sts:AssumeRole"
16:55:46.230 STDOUT terraform:                       + Effect    = "Allow"
16:55:46.230 STDOUT terraform:                       + Principal = {
16:55:46.230 STDOUT terraform:                           + Service = "firehose.amazonaws.com"
16:55:46.230 STDOUT terraform:                         }
16:55:46.230 STDOUT terraform:                       + Sid       = ""
16:55:46.230 STDOUT terraform:                     },
16:55:46.230 STDOUT terraform:                 ]
16:55:46.230 STDOUT terraform:               + Version   = "2012-10-17"
16:55:46.230 STDOUT terraform:             }
16:55:46.230 STDOUT terraform:         )
16:55:46.230 STDOUT terraform:       + create_date           = (known after apply)
16:55:46.230 STDOUT terraform:       + force_detach_policies = false
16:55:46.230 STDOUT terraform:       + id                    = (known after apply)
16:55:46.230 STDOUT terraform:       + managed_policy_arns   = (known after apply)
16:55:46.230 STDOUT terraform:       + max_session_duration  = 3600
16:55:46.230 STDOUT terraform:       + name                  = "firehose_newrelic_role_staging"
16:55:46.230 STDOUT terraform:       + name_prefix           = (known after apply)
16:55:46.230 STDOUT terraform:       + path                  = "/"
16:55:46.230 STDOUT terraform:       + tags_all              = (known after apply)
16:55:46.230 STDOUT terraform:       + unique_id             = (known after apply)
16:55:46.231 STDOUT terraform:       + inline_policy (known after apply)
16:55:46.231 STDOUT terraform:     }
16:55:46.231 STDOUT terraform:   # aws_iam_role.metric_stream_to_firehose[0] will be created
16:55:46.231 STDOUT terraform:   + resource "aws_iam_role" "metric_stream_to_firehose" {
16:55:46.231 STDOUT terraform:       + arn                   = (known after apply)
16:55:46.231 STDOUT terraform:       + assume_role_policy    = jsonencode(
16:55:46.231 STDOUT terraform:             {
16:55:46.231 STDOUT terraform:               + Statement = [
16:55:46.231 STDOUT terraform:                   + {
16:55:46.231 STDOUT terraform:                       + Action    = "sts:AssumeRole"
16:55:46.231 STDOUT terraform:                       + Effect    = "Allow"
16:55:46.231 STDOUT terraform:                       + Principal = {
16:55:46.231 STDOUT terraform:                           + Service = "streams.metrics.cloudwatch.amazonaws.com"
16:55:46.231 STDOUT terraform:                         }
16:55:46.231 STDOUT terraform:                       + Sid       = ""
16:55:46.231 STDOUT terraform:                     },
16:55:46.231 STDOUT terraform:                 ]
16:55:46.231 STDOUT terraform:               + Version   = "2012-10-17"
16:55:46.231 STDOUT terraform:             }
16:55:46.231 STDOUT terraform:         )
16:55:46.231 STDOUT terraform:       + create_date           = (known after apply)
16:55:46.231 STDOUT terraform:       + force_detach_policies = false
16:55:46.231 STDOUT terraform:       + id                    = (known after apply)
16:55:46.231 STDOUT terraform:       + managed_policy_arns   = (known after apply)
16:55:46.231 STDOUT terraform:       + max_session_duration  = 3600
16:55:46.231 STDOUT terraform:       + name                  = "newrelic_metric_stream_to_firehose_role_staging"
16:55:46.231 STDOUT terraform:       + name_prefix           = (known after apply)
16:55:46.231 STDOUT terraform:       + path                  = "/"
16:55:46.231 STDOUT terraform:       + tags_all              = (known after apply)
16:55:46.231 STDOUT terraform:       + unique_id             = (known after apply)
16:55:46.231 STDOUT terraform:       + inline_policy (known after apply)
16:55:46.231 STDOUT terraform:     }
16:55:46.232 STDOUT terraform:   # aws_iam_role.newrelic_aws_role[0] will be created
16:55:46.232 STDOUT terraform:   + resource "aws_iam_role" "newrelic_aws_role" {
16:55:46.232 STDOUT terraform:       + arn                   = (known after apply)
16:55:46.232 STDOUT terraform:       + assume_role_policy    = jsonencode(
16:55:46.232 STDOUT terraform:             {
16:55:46.232 STDOUT terraform:               + Statement = [
16:55:46.232 STDOUT terraform:                   + {
16:55:46.232 STDOUT terraform:                       + Action    = "sts:AssumeRole"
16:55:46.232 STDOUT terraform:                       + Condition = {
16:55:46.232 STDOUT terraform:                           + StringEquals = {
16:55:46.232 STDOUT terraform:                               + "sts:ExternalId" = "2691974"
16:55:46.232 STDOUT terraform:                             }
16:55:46.232 STDOUT terraform:                         }
16:55:46.232 STDOUT terraform:                       + Effect    = "Allow"
16:55:46.232 STDOUT terraform:                       + Principal = {
16:55:46.232 STDOUT terraform:                           + AWS = "754728514883"
16:55:46.232 STDOUT terraform:                         }
16:55:46.232 STDOUT terraform:                     },
16:55:46.232 STDOUT terraform:                 ]
16:55:46.232 STDOUT terraform:               + Version   = "2012-10-17"
16:55:46.232 STDOUT terraform:             }
16:55:46.232 STDOUT terraform:         )
16:55:46.232 STDOUT terraform:       + create_date           = (known after apply)
16:55:46.232 STDOUT terraform:       + description           = "New Relic Cloud integration role"
16:55:46.232 STDOUT terraform:       + force_detach_policies = false
16:55:46.232 STDOUT terraform:       + id                    = (known after apply)
16:55:46.232 STDOUT terraform:       + managed_policy_arns   = (known after apply)
16:55:46.232 STDOUT terraform:       + max_session_duration  = 3600
16:55:46.232 STDOUT terraform:       + name                  = "NewRelicInfrastructure-Integrations-staging"
16:55:46.232 STDOUT terraform:       + name_prefix           = (known after apply)
16:55:46.232 STDOUT terraform:       + path                  = "/"
16:55:46.232 STDOUT terraform:       + tags_all              = (known after apply)
16:55:46.232 STDOUT terraform:       + unique_id             = (known after apply)
16:55:46.233 STDOUT terraform:       + inline_policy (known after apply)
16:55:46.233 STDOUT terraform:     }
16:55:46.233 STDOUT terraform:   # aws_iam_role.newrelic_configuration_recorder[0] will be created
16:55:46.233 STDOUT terraform:   + resource "aws_iam_role" "newrelic_configuration_recorder" {
16:55:46.233 STDOUT terraform:       + arn                   = (known after apply)
16:55:46.233 STDOUT terraform:       + assume_role_policy    = jsonencode(
16:55:46.233 STDOUT terraform:             {
16:55:46.233 STDOUT terraform:               + Statement = [
16:55:46.233 STDOUT terraform:                   + {
16:55:46.233 STDOUT terraform:                       + Action    = "sts:AssumeRole"
16:55:46.233 STDOUT terraform:                       + Effect    = "Allow"
16:55:46.233 STDOUT terraform:                       + Principal = {
16:55:46.233 STDOUT terraform:                           + Service = "config.amazonaws.com"
16:55:46.233 STDOUT terraform:                         }
16:55:46.233 STDOUT terraform:                       + Sid       = ""
16:55:46.233 STDOUT terraform:                     },
16:55:46.233 STDOUT terraform:                 ]
16:55:46.233 STDOUT terraform:               + Version   = "2012-10-17"
16:55:46.233 STDOUT terraform:             }
16:55:46.233 STDOUT terraform:         )
16:55:46.233 STDOUT terraform:       + create_date           = (known after apply)
16:55:46.233 STDOUT terraform:       + force_detach_policies = false
16:55:46.233 STDOUT terraform:       + id                    = (known after apply)
16:55:46.233 STDOUT terraform:       + managed_policy_arns   = (known after apply)
16:55:46.233 STDOUT terraform:       + max_session_duration  = 3600
16:55:46.233 STDOUT terraform:       + name                  = "newrelic_configuration_recorder-staging"
16:55:46.233 STDOUT terraform:       + name_prefix           = (known after apply)
16:55:46.233 STDOUT terraform:       + path                  = "/"
16:55:46.233 STDOUT terraform:       + tags_all              = (known after apply)
16:55:46.233 STDOUT terraform:       + unique_id             = (known after apply)
16:55:46.233 STDOUT terraform:       + inline_policy (known after apply)
16:55:46.234 STDOUT terraform:     }
16:55:46.234 STDOUT terraform:   # aws_iam_role_policy.newrelic_configuration_recorder_s3[0] will be created
16:55:46.234 STDOUT terraform:   + resource "aws_iam_role_policy" "newrelic_configuration_recorder_s3" {
16:55:46.234 STDOUT terraform:       + id          = (known after apply)
16:55:46.234 STDOUT terraform:       + name        = "newrelic-configuration-recorder-s3-staging"
16:55:46.234 STDOUT terraform:       + name_prefix = (known after apply)
16:55:46.234 STDOUT terraform:       + policy      = (known after apply)
16:55:46.234 STDOUT terraform:       + role        = (known after apply)
16:55:46.234 STDOUT terraform:     }
16:55:46.234 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_aws_policy_attach[0] will be created
16:55:46.234 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_aws_policy_attach" {
16:55:46.234 STDOUT terraform:       + id         = (known after apply)
16:55:46.234 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
16:55:46.234 STDOUT terraform:       + role       = "NewRelicInfrastructure-Integrations-staging"
16:55:46.234 STDOUT terraform:     }
16:55:46.234 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_configuration_recorder[0] will be created
16:55:46.234 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_configuration_recorder" {
16:55:46.234 STDOUT terraform:       + id         = (known after apply)
16:55:46.234 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole"
16:55:46.234 STDOUT terraform:       + role       = "newrelic_configuration_recorder-staging"
16:55:46.234 STDOUT terraform:     }
16:55:46.234 STDOUT terraform:   # aws_s3_bucket.newrelic_aws_bucket[0] will be created
16:55:46.234 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_aws_bucket" {
16:55:46.234 STDOUT terraform:       + acceleration_status         = (known after apply)
16:55:46.234 STDOUT terraform:       + acl                         = (known after apply)
16:55:46.234 STDOUT terraform:       + arn                         = (known after apply)
16:55:46.235 STDOUT terraform:       + bucket                      = (known after apply)
16:55:46.235 STDOUT terraform:       + bucket_domain_name          = (known after apply)
16:55:46.235 STDOUT terraform:       + bucket_prefix               = (known after apply)
16:55:46.235 STDOUT terraform:       + bucket_region               = (known after apply)
16:55:46.235 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
16:55:46.235 STDOUT terraform:       + force_destroy               = true
16:55:46.235 STDOUT terraform:       + hosted_zone_id              = (known after apply)
16:55:46.235 STDOUT terraform:       + id                          = (known after apply)
16:55:46.235 STDOUT terraform:       + object_lock_enabled         = (known after apply)
16:55:46.235 STDOUT terraform:       + policy                      = (known after apply)
16:55:46.235 STDOUT terraform:       + region                      = "ca-central-1"
16:55:46.235 STDOUT terraform:       + request_payer               = (known after apply)
16:55:46.235 STDOUT terraform:       + tags_all                    = (known after apply)
16:55:46.235 STDOUT terraform:       + website_domain              = (known after apply)
16:55:46.235 STDOUT terraform:       + website_endpoint            = (known after apply)
16:55:46.235 STDOUT terraform:       + cors_rule (known after apply)
16:55:46.235 STDOUT terraform:       + grant (known after apply)
16:55:46.235 STDOUT terraform:       + lifecycle_rule (known after apply)
16:55:46.235 STDOUT terraform:       + logging (known after apply)
16:55:46.235 STDOUT terraform:       + object_lock_configuration (known after apply)
16:55:46.235 STDOUT terraform:       + replication_configuration (known after apply)
16:55:46.235 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
16:55:46.235 STDOUT terraform:       + versioning (known after apply)
16:55:46.235 STDOUT terraform:       + website (known after apply)
16:55:46.235 STDOUT terraform:     }
16:55:46.235 STDOUT terraform:   # aws_s3_bucket.newrelic_configuration_recorder_s3[0] will be created
16:55:46.235 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_configuration_recorder_s3" {
16:55:46.235 STDOUT terraform:       + acceleration_status         = (known after apply)
16:55:46.236 STDOUT terraform:       + acl                         = (known after apply)
16:55:46.236 STDOUT terraform:       + arn                         = (known after apply)
16:55:46.236 STDOUT terraform:       + bucket                      = (known after apply)
16:55:46.236 STDOUT terraform:       + bucket_domain_name          = (known after apply)
16:55:46.236 STDOUT terraform:       + bucket_prefix               = (known after apply)
16:55:46.236 STDOUT terraform:       + bucket_region               = (known after apply)
16:55:46.236 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
16:55:46.236 STDOUT terraform:       + force_destroy               = true
16:55:46.236 STDOUT terraform:       + hosted_zone_id              = (known after apply)
16:55:46.236 STDOUT terraform:       + id                          = (known after apply)
16:55:46.236 STDOUT terraform:       + object_lock_enabled         = (known after apply)
16:55:46.236 STDOUT terraform:       + policy                      = (known after apply)
16:55:46.236 STDOUT terraform:       + region                      = "ca-central-1"
16:55:46.236 STDOUT terraform:       + request_payer               = (known after apply)
16:55:46.236 STDOUT terraform:       + tags_all                    = (known after apply)
16:55:46.236 STDOUT terraform:       + website_domain              = (known after apply)
16:55:46.236 STDOUT terraform:       + website_endpoint            = (known after apply)
16:55:46.236 STDOUT terraform:       + cors_rule (known after apply)
16:55:46.236 STDOUT terraform:       + grant (known after apply)
16:55:46.236 STDOUT terraform:       + lifecycle_rule (known after apply)
16:55:46.236 STDOUT terraform:       + logging (known after apply)
16:55:46.236 STDOUT terraform:       + object_lock_configuration (known after apply)
16:55:46.236 STDOUT terraform:       + replication_configuration (known after apply)
16:55:46.236 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
16:55:46.236 STDOUT terraform:       + versioning (known after apply)
16:55:46.236 STDOUT terraform:       + website (known after apply)
16:55:46.237 STDOUT terraform:     }
16:55:46.237 STDOUT terraform:   # aws_s3_bucket_ownership_controls.newrelic_ownership_controls[0] will be created
16:55:46.237 STDOUT terraform:   + resource "aws_s3_bucket_ownership_controls" "newrelic_ownership_controls" {
16:55:46.237 STDOUT terraform:       + bucket = (known after apply)
16:55:46.237 STDOUT terraform:       + id     = (known after apply)
16:55:46.237 STDOUT terraform:       + region = "ca-central-1"
16:55:46.237 STDOUT terraform:       + rule {
16:55:46.237 STDOUT terraform:           + object_ownership = "BucketOwnerEnforced"
16:55:46.237 STDOUT terraform:         }
16:55:46.237 STDOUT terraform:     }
16:55:46.237 STDOUT terraform:   # aws_sns_sms_preferences.update-sms-prefs-us-west-2 will be updated in-place
16:55:46.237 STDOUT terraform:   ~ resource "aws_sns_sms_preferences" "update-sms-prefs-us-west-2" {
16:55:46.237 STDOUT terraform:         id                                    = "aws_sns_sms_id"
16:55:46.237 STDOUT terraform:       ~ monthly_spend_limit                   = 30 -> 300
16:55:46.237 STDOUT terraform:         # (6 unchanged attributes hidden)
16:55:46.237 STDOUT terraform:     }
16:55:46.237 STDOUT terraform:   # newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull[0] will be created
16:55:46.237 STDOUT terraform:   + resource "newrelic_cloud_aws_integrations" "newrelic_cloud_integration_pull" {
16:55:46.237 STDOUT terraform:       + account_id        = (sensitive value)
16:55:46.237 STDOUT terraform:       + id                = (known after apply)
16:55:46.237 STDOUT terraform:       + linked_account_id = (known after apply)
16:55:46.237 STDOUT terraform:       + lambda {
16:55:46.237 STDOUT terraform:           + fetch_tags               = true
16:55:46.237 STDOUT terraform:           + metrics_polling_interval = 300
16:55:46.237 STDOUT terraform:         }
16:55:46.237 STDOUT terraform:     }
16:55:46.237 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull[0] will be created
16:55:46.238 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_pull" {
16:55:46.238 STDOUT terraform:       + account_id             = (sensitive value)
16:55:46.238 STDOUT terraform:       + arn                    = (known after apply)
16:55:46.238 STDOUT terraform:       + id                     = (known after apply)
16:55:46.238 STDOUT terraform:       + metric_collection_mode = "PULL"
16:55:46.238 STDOUT terraform:       + name                   = "staging pull"
16:55:46.238 STDOUT terraform:     }
16:55:46.238 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_push[0] will be created
16:55:46.238 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_push" {
16:55:46.238 STDOUT terraform:       + account_id             = (sensitive value)
16:55:46.238 STDOUT terraform:       + arn                    = (known after apply)
16:55:46.238 STDOUT terraform:       + id                     = (known after apply)
16:55:46.238 STDOUT terraform:       + metric_collection_mode = "PUSH"
16:55:46.238 STDOUT terraform:       + name                   = "staging metric stream"
16:55:46.238 STDOUT terraform:     }
16:55:46.238 STDOUT terraform:   # random_string.s3-bucket-name[0] will be created
16:55:46.238 STDOUT terraform:   + resource "random_string" "s3-bucket-name" {
16:55:46.238 STDOUT terraform:       + id          = (known after apply)
16:55:46.238 STDOUT terraform:       + length      = 8
16:55:46.238 STDOUT terraform:       + lower       = true
16:55:46.238 STDOUT terraform:       + min_lower   = 0
16:55:46.238 STDOUT terraform:       + min_numeric = 0
16:55:46.238 STDOUT terraform:       + min_special = 0
16:55:46.238 STDOUT terraform:       + min_upper   = 0
16:55:46.238 STDOUT terraform:       + number      = true
16:55:46.238 STDOUT terraform:       + numeric     = true
16:55:46.239 STDOUT terraform:       + result      = (known after apply)
16:55:46.239 STDOUT terraform:       + special     = false
16:55:46.239 STDOUT terraform:       + upper       = false
16:55:46.239 STDOUT terraform:     }
16:55:46.239 STDOUT terraform: Plan: 15 to add, 1 to change, 0 to destroy.
16:55:46.239 STDOUT terraform: Warning: Argument is deprecated
16:55:46.239 STDOUT terraform:   with aws_s3_bucket.csv_bucket,
16:55:46.239 STDOUT terraform:   on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
16:55:46.239 STDOUT terraform:    5: resource "aws_s3_bucket" "csv_bucket" {
16:55:46.239 STDOUT terraform: lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
16:55:46.239 STDOUT terraform: resource instead.
16:55:46.239 STDOUT terraform: (and 61 more similar warnings elsewhere)
16:55:46.239 STDOUT terraform: Warning: Deprecated attribute
16:55:46.239 STDOUT terraform:   on .terraform/modules/notify_slack_critical.lambda/outputs.tf line 9, in output "lambda_function_arn_static":
16:55:46.239 STDOUT terraform:    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:aws:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
16:55:46.239 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
16:55:46.239 STDOUT terraform: details.
16:55:46.239 STDOUT terraform: (and 17 more similar warnings elsewhere)
16:55:23.564 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
16:55:24.094 INFO   Executing hook: get-admin
Cloning into '/var/tmp/notification-admin'...
16:55:46.239 STDERR terraform: Error: the following validation errors have been identified with the configuration of the synthetic monitor: 
16:55:46.239 STDERR terraform: (1): the `user_id` attribute is required when `key_type` is set to USER, please specify a valid user ID
16:55:46.239 STDERR terraform:   with newrelic_api_access_key.newrelic_aws_access_key[0],
16:55:46.239 STDERR terraform:   on newrelic.tf line 90, in resource "newrelic_api_access_key" "newrelic_aws_access_key":
16:55:46.239 STDERR terraform:   90: resource "newrelic_api_access_key" "newrelic_aws_access_key" {
16:55:46.342 ERROR  terraform invocation failed in ./.terragrunt-cache/vSsGrkoVpAumzVObg4Ds4hDC_7Y/ziUKr5pa_JoeDZ3wgSbieuIpHJE/common
16:55:46.343 INFO   Executing hook: cleanup-admin
16:55:46.388 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/vSsGrkoVpAumzVObg4Ds4hDC_7Y/ziUKr5pa_JoeDZ3wgSbieuIpHJE/common
  
  Error: the following validation errors have been identified with the configuration of the synthetic monitor: 
  (1): the `user_id` attribute is required when `key_type` is set to USER, please specify a valid user ID
  
  
    with newrelic_api_access_key.newrelic_aws_access_key[0],
    on newrelic.tf line 90, in resource "newrelic_api_access_key" "newrelic_aws_access_key":
    90: resource "newrelic_api_access_key" "newrelic_aws_access_key" {
  
  
  exit status 1


```

</details>

